---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorVisibleSize
source: html/923c46fc-0138-fc0a-c84d-b0edd77c4602.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorVisibleSize Property

"Size on screen"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorVisibleSize { get; }
```